service/estes/rateService/request_body/req_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rat="http://ws.estesexpress.com/ratequote" xmlns:rat1="http://ws.estesexpress.com/schema/2019/01/ratequote">
  <soapenv:Header>
     <rat:auth>
        <rat:user>myway1</rat:user>
        <rat:password>NewPass21</rat:password>
     </rat:auth>
  </soapenv:Header>
  <soapenv:Body>
     <rat1:rateRequest>
        <rat1:requestID>test1234</rat1:requestID>
        <rat1:account>B008478</rat1:account>
        <rat1:originPoint>
           <rat1:countryCode>US</rat1:countryCode>
            <rat1:postalCode>08817</rat1:postalCode>
            <rat1:city>Edison</rat1:city>
            <rat1:stateProvince>NJ</rat1:stateProvince>
        </rat1:originPoint>
        <rat1:destinationPoint>
            <rat1:countryCode>US</rat1:countryCode>
            <rat1:postalCode>43125</rat1:postalCode>
            <rat1:city>Groveport</rat1:city>
            <rat1:stateProvince>OH</rat1:stateProvince>
        </rat1:destinationPoint>
        <rat1:payor>T</rat1:payor>
        <rat1:terms>P</rat1:terms>
        <rat1:pickup>
           <rat1:date>2022-04-21</rat1:date>
            <rat1:ready>05:30:00</rat1:ready>
            <rat1:close>10:30:00</rat1:close>
        </rat1:pickup>
        <rat1:declaredValue>0</rat1:declaredValue>
        <rat1:declaredValueWaived>Y</rat1:declaredValueWaived>
        <rat1:stackable>Y</rat1:stackable>
         <rat1:linearFeet>9</rat1:linearFeet>
        
        <rat1:fullCommodities>
        <rat1:commodity>
                <rat1:class>70</rat1:class>
                  <rat1:weight>8500000</rat1:weight>
                  <rat1:pieces>1</rat1:pieces>
                  <rat1:pieceType>PT</rat1:pieceType>
                  <rat1:dimensions>
                    <rat1:length>40</rat1:length>
                    <rat1:width>48</rat1:width>
                    <rat1:height>60</rat1:height>
                  </rat1:dimensions>
                </rat1:commodity>
        </rat1:fullCommodities>
        <rat1:accessorials>
            <rat1:accessorialCode>AKHAZ</rat1:accessorialCode>
         </rat1:accessorials>
     </rat1:rateRequest>
  </soapenv:Body>
  </soapenv:Envelope>